SubscriberService/exampleRequests/DeliverAverageSpeedFusedDataRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:ns2="http://www.thalesgroup.com/NTIS/Datex2Extensions/1.0Beta1"
	xmlns:ns3="http://datex2.eu/schema/2/2_0" xmlns:sub="http://www.thalesgroup.com/NTIS/SubscriberService"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Header />
	<soapenv:Body>
		<sub:DeliverAverageSpeedFusedDataRequest>
			<sub:D2LogicalModel modelBaseVersion="2">
				<ns3:exchange>
					<ns3:supplierIdentification>
						<ns3:country>gb</ns3:country>
						<ns3:nationalIdentifier>THALES</ns3:nationalIdentifier>
					</ns3:supplierIdentification>
				</ns3:exchange>
				<ns3:payloadPublication lang="en" xsi:type="ns2:FusedDataPublication">
					<ns3:publicationTime>2012-02-08T10:55:46.020Z</ns3:publicationTime>
					<ns3:publicationCreator>
						<ns3:country>gb</ns3:country>
						<ns3:nationalIdentifier>THALES</ns3:nationalIdentifier>
					</ns3:publicationCreator>
					<ns2:headerInformation>
						<ns3:confidentiality>restrictedToAuthoritiesTrafficOperatorsAndPublishers</ns3:confidentiality>
						<ns3:informationStatus>real</ns3:informationStatus>
						<ns3:urgency>normalUrgency</ns3:urgency>
					</ns2:headerInformation>
					<ns2:fusedData>
						<ns2:markets>
							<ns2:createdLocal>2012-02-08T10:55:41.586Z</ns2:createdLocal>
							<ns2:tmcs>
								<ns2:direction>N</ns2:direction>
								<ns2:code>code</ns2:code>
								<ns2:region>UK</ns2:region>
								<ns2:speedSensorOnlyKph>10.0</ns2:speedSensorOnlyKph>
								<ns2:country>England</ns2:country>
								<ns2:headwayDeciseconds>78.2</ns2:headwayDeciseconds>
								<ns2:volumeVehiclesPerMin>24.4</ns2:volumeVehiclesPerMin>
								<ns2:occupancyPercent>57.0</ns2:occupancyPercent>
							</ns2:tmcs>
						</ns2:markets>
						<ns2:createdUtc>2012-02-08T10:55:41.547Z</ns2:createdUtc>
						<ns2:maxArrivalUtc>2012-02-08T10:55:41.547Z</ns2:maxArrivalUtc>
						<ns2:latencySec>0.0</ns2:latencySec>
					</ns2:fusedData>
				</ns3:payloadPublication>
			</sub:D2LogicalModel>
		</sub:DeliverAverageSpeedFusedDataRequest>
	</soapenv:Body>
</soapenv:Envelope>